linux/book/linux_shell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-24 四 20:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux就该这么学</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry https://github.com/rzry" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">linux就该这么学</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67f9c8e"><span class="done DONE">DONE</span> 第三章</a>
<ul>
<li><a href="#orgac0ab98">shell</a></li>
</ul>
</li>
<li><a href="#org483a223"><span class="done DONE">DONE</span> 第四章</a>
<ul>
<li><a href="#orge7903f3">监测</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org67f9c8e" class="outline-2">
<h2 id="org67f9c8e"><span class="done DONE">DONE</span> 第三章</h2>
<div class="outline-text-2" id="text-org67f9c8e">
</div>
<div id="outline-container-orgac0ab98" class="outline-3">
<h3 id="orgac0ab98">shell</h3>
<div class="outline-text-3" id="text-orgac0ab98">
<ul class="org-ul">
<li>/etc/passwd文件包含了所有系统用户账户列表以及每个用户的基本配置信息</li>
<li>rzry:x:1000:1000:rzry,,,:/home/rzry:/bin/zsh</li>
</ul>
<hr />
<hr />
</div>
</div>
</div>
<div id="outline-container-org483a223" class="outline-2">
<h2 id="org483a223"><span class="done DONE">DONE</span> 第四章</h2>
<div class="outline-text-2" id="text-org483a223">
</div>
<div id="outline-container-orge7903f3" class="outline-3">
<h3 id="orge7903f3">监测</h3>
<div class="outline-text-3" id="text-orge7903f3">
</div>
<div id="outline-container-orga6d05a3" class="outline-4">
<h4 id="orga6d05a3">top 的输出</h4>
<div class="outline-text-4" id="text-orga6d05a3">
<pre class="example">
 pid    USER   PR    NI    VIRT     RES     SHR       S     %CPU             %MEM     TIME+ COMMAND                                                                                                                                                                                    
 2712   root   20    0    715060   271296  133612     R      6.6              0.8     51:59.30 Xorg   
 进程id 用户名 优先级  谦让度 虚拟内存  物理内存 共享内存总量 状态  cpu使用的时间比例  内存占用比例  时间   程序名

D 中断 ,  R 正在运行  , S休眠  , T 跟踪状态或停止状态  , Z 僵化   

</pre>
<hr />
<hr />
</div>
</div>
<div id="outline-container-orgff7d566" class="outline-4">
<h4 id="orgff7d566">磁盘空间</h4>
<div class="outline-text-4" id="text-orgff7d566">
<pre class="example">
默认情况下， mount命令会输出当前系统上挂载的设备列表
nsfs on /run/snapd/ns/gnome-calculator.mnt type nsfs (rw)
媒体的设备文件名  nsfs
媒体挂载到虚拟目录的挂载点 /run/....
文件系统类型   type
访问状态 rw 
</pre>
<hr />
<hr />
</div>
<ul class="org-ul">
<li><a id="org8ccff55"></a>挂载<br />
<div class="outline-text-6" id="text-org8ccff55">
<ul class="org-ul">
<li>mount -t vfat /dev/sdb1 /media/rzry</li>
<li>把一个vfat的类型的文件从/dev/sdb1 挂载到/media/rzry</li>
<li>-o 参数 允许增加额外选项 , ro 只读形式 , rw 读写 check=none 等</li>
</ul>
</div>
</li>
<li><a id="org1a24a59"></a>卸载<br />
<div class="outline-text-6" id="text-org1a24a59">
<ul class="org-ul">
<li><p>
umount 卸载 没有n 
</p>
<pre class="example">
用法：
umount [-hV]
umount -a [选项]
umount [选项] &lt;源&gt; | &lt;目录&gt;
</pre></li>
</ul>
<hr />
<hr />
</div>
</li>
<li><a id="orgdc3b072"></a>du命令 查看大文件并处理数据<br />
<div class="outline-text-6" id="text-orgdc3b072">
<pre class="example">
du 会输出类似tree 输出 
du -sh * | sort -nr 
-nr r 会让文件按降序输出 
</pre>
</div>
</li>
<li><a id="org53b35de"></a>grep 搜索<br />
<div class="outline-text-6" id="text-org53b35de">
<pre class="example">
-v 反向
-n 行号
-c 返回多少匹配 返回数字
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-09-24</p>
<p class="author">Author: rzry <a href="https://github.com/rzry">https://github.com/rzry</a></p>
<p class="date">Created: 2020-09-24 四 20:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
